{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "ebe53e2d",
   "metadata": {},
   "outputs": [],
   "source": [
    "import cx_Oracle\n",
    "import os\n",
    "import pandas as pd\n",
    "import xlwings as xw\n",
    "import json\n",
    "import datetime as dt\n",
    "wb_cy = xw.Book('cytiva.xlsm')\n",
    "SHEET_NAMES =  ['Temp_DB', 'Shipment information', '인수증', \n",
    "'대리점송장', '대리점 출고대기', '로컬리스트', 'In-Transit part report', '기타리스트',\n",
    " '출고리스트', 'Cytiva Inventory BIN']\n",
    "LOCATION = r\"C:\\Users\\lms46\\Desktop\\fulfill\\instantclient_fulfill\"\n",
    "os.environ[\"PATH\"] = LOCATION + \";\" + os.environ[\"PATH\"]\n",
    "cx_Oracle.init_oracle_client(lib_dir=LOCATION)\n",
    "\n",
    "connection = cx_Oracle.connect(\n",
    "    user='dw_fulfill', password='fulfillment123QWE!@#', dsn='fulfill_high'\n",
    "\n",
    ")\n",
    "cursor = connection.cursor()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 52,
   "id": "c7e9efe6",
   "metadata": {},
   "outputs": [],
   "source": [
    "my_date_handler = lambda year, month, day, **kwargs: \"%04i-%02i-%02i\" % (year, month, day)\n",
    "connection = cx_Oracle.connect(\n",
    "    user='dw_fulfill', password='fulfillment123QWE!@#', dsn='fulfill_high'\n",
    "\n",
    ")\n",
    "cursor = connection.cursor()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "2696b874",
   "metadata": {},
   "source": [
    "### bring_conditoned_data\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "d14abdad",
   "metadata": {},
   "source": [
    "1. 드랍다운리스트 \n",
    "    - rng.api.Validation.Delete()\n",
    "    - rng.api.Validation.Add(Type=3, Formula1=state_list)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "id": "49bd8050",
   "metadata": {},
   "outputs": [],
   "source": [
    "dv_type = xw.constants.DVType.xlValidateList\n",
    "dv_alertstyle = xw.constants.DVAlertStyle.xlValidAlertStop\n",
    "dv_operator = xw.constants.FormatConditionOperator.xlEqual"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "e7b8d407",
   "metadata": {},
   "outputs": [],
   "source": [
    "sel_sht = wb_cy.selection.sheet"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "id": "602fcbc9",
   "metadata": {},
   "outputs": [
    {
     "ename": "com_error",
     "evalue": "(-2147352567, '예외가 발생했습니다.', (0, None, None, None, 0, -2146827284), None)",
     "output_type": "error",
     "traceback": [
      "\u001b[1;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[1;31mcom_error\u001b[0m                                 Traceback (most recent call last)",
      "Cell \u001b[1;32mIn [18], line 16\u001b[0m\n\u001b[0;32m     14\u001b[0m rng_dt \u001b[38;5;241m=\u001b[39m sel_sht\u001b[38;5;241m.\u001b[39mrange((\u001b[38;5;241m2\u001b[39m,\u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mC\u001b[39m\u001b[38;5;124m\"\u001b[39m))\n\u001b[0;32m     15\u001b[0m rng_dt\u001b[38;5;241m.\u001b[39mapi\u001b[38;5;241m.\u001b[39mValidation\u001b[38;5;241m.\u001b[39mDelete()\n\u001b[1;32m---> 16\u001b[0m \u001b[43mrng_dt\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mapi\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mValidation\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mAdd\u001b[49m\u001b[43m(\u001b[49m\u001b[43mType\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[43mdv_type\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mFormula1\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[43mstr_dt\u001b[49m\u001b[43m)\u001b[49m\n",
      "File \u001b[1;32m~\\AppData\\Local\\Packages\\PythonSoftwareFoundation.Python.3.10_qbz5n2kfra8p0\\LocalCache\\local-packages\\Python310\\site-packages\\xlwings\\_xlwindows.py:109\u001b[0m, in \u001b[0;36mCOMRetryMethodWrapper.__call__\u001b[1;34m(self, *args, **kwargs)\u001b[0m\n\u001b[0;32m    107\u001b[0m \u001b[38;5;28;01mwhile\u001b[39;00m \u001b[38;5;28;01mTrue\u001b[39;00m:\n\u001b[0;32m    108\u001b[0m     \u001b[38;5;28;01mtry\u001b[39;00m:\n\u001b[1;32m--> 109\u001b[0m         v \u001b[38;5;241m=\u001b[39m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m__method(\u001b[38;5;241m*\u001b[39margs, \u001b[38;5;241m*\u001b[39m\u001b[38;5;241m*\u001b[39mkwargs)\n\u001b[0;32m    110\u001b[0m         \u001b[38;5;28;01mif\u001b[39;00m \u001b[38;5;28misinstance\u001b[39m(v, (CDispatch, CoClassBaseClass, DispatchBaseClass)):\n\u001b[0;32m    111\u001b[0m             \u001b[38;5;28;01mreturn\u001b[39;00m COMRetryObjectWrapper(v)\n",
      "File \u001b[1;32m~\\AppData\\Local\\Temp\\gen_py\\3.10\\00020813-0000-0000-C000-000000000046x0x1x9.py:40352\u001b[0m, in \u001b[0;36mValidation.Add\u001b[1;34m(self, Type, AlertStyle, Operator, Formula1, Formula2)\u001b[0m\n\u001b[0;32m  40350\u001b[0m \u001b[38;5;28;01mdef\u001b[39;00m \u001b[38;5;21mAdd\u001b[39m(\u001b[38;5;28mself\u001b[39m, Type\u001b[38;5;241m=\u001b[39mdefaultNamedNotOptArg, AlertStyle\u001b[38;5;241m=\u001b[39mdefaultNamedOptArg, Operator\u001b[38;5;241m=\u001b[39mdefaultNamedOptArg, Formula1\u001b[38;5;241m=\u001b[39mdefaultNamedOptArg\n\u001b[0;32m  40351\u001b[0m \t\t, Formula2\u001b[38;5;241m=\u001b[39mdefaultNamedOptArg):\n\u001b[1;32m> 40352\u001b[0m \t\u001b[38;5;28;01mreturn\u001b[39;00m \u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_oleobj_\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mInvokeTypes\u001b[49m\u001b[43m(\u001b[49m\u001b[38;5;241;43m181\u001b[39;49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mLCID\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[38;5;241;43m1\u001b[39;49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43m(\u001b[49m\u001b[38;5;241;43m24\u001b[39;49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[38;5;241;43m0\u001b[39;49m\u001b[43m)\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43m(\u001b[49m\u001b[43m(\u001b[49m\u001b[38;5;241;43m3\u001b[39;49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[38;5;241;43m1\u001b[39;49m\u001b[43m)\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43m(\u001b[49m\u001b[38;5;241;43m12\u001b[39;49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[38;5;241;43m17\u001b[39;49m\u001b[43m)\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43m(\u001b[49m\u001b[38;5;241;43m12\u001b[39;49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[38;5;241;43m17\u001b[39;49m\u001b[43m)\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43m(\u001b[49m\u001b[38;5;241;43m12\u001b[39;49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[38;5;241;43m17\u001b[39;49m\u001b[43m)\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43m(\u001b[49m\u001b[38;5;241;43m12\u001b[39;49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[38;5;241;43m17\u001b[39;49m\u001b[43m)\u001b[49m\u001b[43m)\u001b[49m\u001b[43m,\u001b[49m\u001b[43mType\u001b[49m\n\u001b[0;32m  40353\u001b[0m \u001b[43m\t\t\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mAlertStyle\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mOperator\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mFormula1\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mFormula2\u001b[49m\u001b[43m)\u001b[49m\n",
      "\u001b[1;31mcom_error\u001b[0m: (-2147352567, '예외가 발생했습니다.', (0, None, None, None, 0, -2146827284), None)"
     ]
    }
   ],
   "source": [
    "# 셀정보받기\n",
    "last_col = sel_sht.range('XFD9').end('left').column\n",
    "last_row = sel_sht.range('A1048576').end('up').row\n",
    "if last_row < 10 : last_row=10\n",
    "sel_sht.range((10,1),(last_row,last_col)).delete() # 기존 데이터 삭제\n",
    "\n",
    "col_names = sel_sht.range((9,1),(9,last_col)).value\n",
    "\n",
    "\n",
    "# 드랍다운 리스트 받기\n",
    "\n",
    "# DATE_TYPE\n",
    "str_dt = 'Dog,Cat,Bat'\n",
    "rng_dt = sel_sht.range((2,\"C\"))\n",
    "rng_dt.api.Validation.Delete()\n",
    "rng_dt.api.Validation.Add(Type=dv_type, Formula1=str_dt)\n",
    "\n",
    "# # STATE\n",
    "# str_state = \"ALL,\" + \",\".join(pd.DataFrame(cursor.execute(\"select * from inspection_code\").fetchall())[0])\n",
    "# rng_state = sel_sht.range((5,\"C\"))\n",
    "# rng_state.api.Validation.Delete()\n",
    "# rng_state.api.Validation.Add(Type=3, Formula1=str_state)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 109,
   "id": "f256bebd",
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['ARRIVAL_DATE', 'ALL', '2023-03-02', 'SHIP_CONFIRM', 'ALL', 'KR_LTH']"
      ]
     },
     "execution_count": 109,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# 검색조건 받기\n",
    "sel_sht = wb_cy.selection.sheet\n",
    "conditions= []\n",
    "for i in range(2,8):\n",
    "    conditions.append(sel_sht.range((i,\"C\")).options(numbers=lambda e : str(int(e)), dates=my_date_handler).value)\n",
    "    j=i-2\n",
    "    if conditions[j] is None:\n",
    "        if j == 0:\n",
    "            conditions[j] = 'ARRIVAL_DATE'\n",
    "        else:\n",
    "            conditions[j] = 'ALL'\n",
    "    \n",
    "\n",
    "conditions"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 110,
   "id": "d16d6cb4",
   "metadata": {},
   "outputs": [],
   "source": [
    "base_query = \"SELECT * FROM IR_ORDER \"\n",
    "\n",
    "if conditions[1] == 'ALL': conditions[1] = '1999-01-01'\n",
    "if conditions[2] ==  'ALL': conditions[2] = '2199-12-31'\n",
    "\n",
    "query = base_query + f\"WHERE {conditions[0]} BETWEEN '{conditions[1]}' AND '{conditions[2]}' \"\n",
    "query = query if conditions[3] == 'ALL' else query + f\"AND STATE = '{conditions[3]}' \"\n",
    "query = query if conditions[4] ==  'ALL' else query + f\"AND ARTICLE_NUMBER = '{conditions[4]}' \"\n",
    "query = query if conditions[5] ==  'ALL' else query + f\"AND SUBINVENTORY = '{conditions[5]}'\"\n",
    "\n",
    "# Data fomatting\n",
    "df_ir = pd.DataFrame(cursor.execute(query).fetchall(),columns=col_names)\n",
    "df_ir['TIMELINE'] = df_ir['TIMELINE'].map(lambda e: json.loads(e)['data'][-1]['c'])\n",
    "df_ir = df_ir.sort_values('IR_INDEX')\n",
    "df_ir.set_index('IR_INDEX',inplace=True)\n",
    "\n",
    "sel_sht.range(\"A9\").value = df_ir\n",
    "\n",
    "last_row = sel_sht.range(\"B1048576\").end('up').row\n",
    "last_col = sel_sht.range(\"XFD9\").end(\"left\").column\n",
    "xl_content = sel_sht.range((10,1),(last_row,last_col))\n",
    "xl_content.api.Borders.LineStyle = 1 "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 107,
   "id": "0bf1ba75",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>IR_INDEX</th>\n",
       "      <th>ARTICLE_NUMBER</th>\n",
       "      <th>DESCRIPTION</th>\n",
       "      <th>QUANTITY</th>\n",
       "      <th>ORDER_NM</th>\n",
       "      <th>ARRIVAL_DATE</th>\n",
       "      <th>SUBINVENTORY</th>\n",
       "      <th>SHIP_DATE</th>\n",
       "      <th>COMMENT</th>\n",
       "      <th>STATE</th>\n",
       "      <th>TIMELINE</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>262</td>\n",
       "      <td>18111204</td>\n",
       "      <td>SEAL KIT 100ML</td>\n",
       "      <td>4</td>\n",
       "      <td>IR-SM00033782</td>\n",
       "      <td>2017-08-01</td>\n",
       "      <td>KR_LTH</td>\n",
       "      <td>2017-08-10</td>\n",
       "      <td>08/10녹십자건으로 이태환과장님출고</td>\n",
       "      <td>SHIP_CONFIRM</td>\n",
       "      <td>2023-03-01 11:10:27</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>263</td>\n",
       "      <td>18111126</td>\n",
       "      <td>PH ELECTRODE, ROUND TIP</td>\n",
       "      <td>1</td>\n",
       "      <td>IR-SM00033782</td>\n",
       "      <td>2017-08-01</td>\n",
       "      <td>KR_LTH</td>\n",
       "      <td>2017-08-10</td>\n",
       "      <td>08/10녹십자건으로 이태환과장님출고</td>\n",
       "      <td>SHIP_CONFIRM</td>\n",
       "      <td>2023-03-01 11:10:27</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>264</td>\n",
       "      <td>29249817</td>\n",
       "      <td>LAMP ASSY CPL</td>\n",
       "      <td>1</td>\n",
       "      <td>IR-SM00033782</td>\n",
       "      <td>2017-08-01</td>\n",
       "      <td>KR_LTH</td>\n",
       "      <td>2017-08-10</td>\n",
       "      <td>08/10녹십자건으로 이태환과장님출고</td>\n",
       "      <td>SHIP_CONFIRM</td>\n",
       "      <td>2023-03-01 11:10:27</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>276</td>\n",
       "      <td>18112962</td>\n",
       "      <td>UV TEST KIT 254NM, 2MM CELL</td>\n",
       "      <td>2</td>\n",
       "      <td>IR-SM00034308</td>\n",
       "      <td>2017-08-07</td>\n",
       "      <td>KR_LTH</td>\n",
       "      <td>2017-08-10</td>\n",
       "      <td>08/10 KR_SERV01로 Transfer후 stock</td>\n",
       "      <td>SHIP_CONFIRM</td>\n",
       "      <td>2023-03-01 11:10:27</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>278</td>\n",
       "      <td>28952645</td>\n",
       "      <td>P9S Drive unit</td>\n",
       "      <td>1</td>\n",
       "      <td>IR-SM00034389</td>\n",
       "      <td>2017-08-08</td>\n",
       "      <td>KR_LTH</td>\n",
       "      <td>2017-08-10</td>\n",
       "      <td>08/10삼성바이오에피스건으로 이태환과장님출고</td>\n",
       "      <td>SHIP_CONFIRM</td>\n",
       "      <td>2023-03-01 11:10:27</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>414</th>\n",
       "      <td>3692</td>\n",
       "      <td>BR100600</td>\n",
       "      <td>System Check Kit, type 2</td>\n",
       "      <td>3</td>\n",
       "      <td>IR-SM00388508</td>\n",
       "      <td>2020-09-01</td>\n",
       "      <td>KR_LTH</td>\n",
       "      <td>2020-09-15</td>\n",
       "      <td>09/15 KR_SERV01로 stock</td>\n",
       "      <td>SHIP_CONFIRM</td>\n",
       "      <td>2023-03-01 11:10:27</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>415</th>\n",
       "      <td>3693</td>\n",
       "      <td>29256413</td>\n",
       "      <td>PM kit HW, type105</td>\n",
       "      <td>3</td>\n",
       "      <td>IR-SM00388508</td>\n",
       "      <td>2020-09-01</td>\n",
       "      <td>KR_LTH</td>\n",
       "      <td>2020-09-15</td>\n",
       "      <td>09/15 KR_SERV01로 stock</td>\n",
       "      <td>SHIP_CONFIRM</td>\n",
       "      <td>2023-03-01 11:10:27</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>416</th>\n",
       "      <td>3969</td>\n",
       "      <td>52-852996-001-9</td>\n",
       "      <td>FRU MOTHERBOARD PCIE ASSY PROGRAMMED IC/MIC</td>\n",
       "      <td>1</td>\n",
       "      <td>IR-SM00401737</td>\n",
       "      <td>2020-10-13</td>\n",
       "      <td>KR_LTH</td>\n",
       "      <td>2020-10-14</td>\n",
       "      <td>10/14 이태환님 서울대 건으로 출고</td>\n",
       "      <td>SHIP_CONFIRM</td>\n",
       "      <td>2023-03-01 11:10:27</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>417</th>\n",
       "      <td>3723</td>\n",
       "      <td>28999471</td>\n",
       "      <td>PM-kit AKTA avant</td>\n",
       "      <td>1</td>\n",
       "      <td>IR-SM00386805</td>\n",
       "      <td>2020-09-04</td>\n",
       "      <td>KR_LTH</td>\n",
       "      <td>2020-09-15</td>\n",
       "      <td>09/15 이태환님 요청으로 KR_serv01로 stock</td>\n",
       "      <td>SHIP_CONFIRM</td>\n",
       "      <td>2023-03-01 11:10:27</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>418</th>\n",
       "      <td>4361</td>\n",
       "      <td>BR100507</td>\n",
       "      <td>Docking motor (with coupling)</td>\n",
       "      <td>1</td>\n",
       "      <td>IR-SM00440784</td>\n",
       "      <td>2020-12-21</td>\n",
       "      <td>KR_LTH</td>\n",
       "      <td>2020-12-30</td>\n",
       "      <td>12/30 DGMIF 김병창님  출고</td>\n",
       "      <td>SHIP_CONFIRM</td>\n",
       "      <td>2023-03-01 11:10:27</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>419 rows × 11 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "     IR_INDEX   ARTICLE_NUMBER                                  DESCRIPTION  \\\n",
       "0         262         18111204                               SEAL KIT 100ML   \n",
       "1         263         18111126                      PH ELECTRODE, ROUND TIP   \n",
       "2         264         29249817                                LAMP ASSY CPL   \n",
       "3         276         18112962                  UV TEST KIT 254NM, 2MM CELL   \n",
       "4         278         28952645                               P9S Drive unit   \n",
       "..        ...              ...                                          ...   \n",
       "414      3692         BR100600                     System Check Kit, type 2   \n",
       "415      3693         29256413                           PM kit HW, type105   \n",
       "416      3969  52-852996-001-9  FRU MOTHERBOARD PCIE ASSY PROGRAMMED IC/MIC   \n",
       "417      3723         28999471                            PM-kit AKTA avant   \n",
       "418      4361         BR100507                Docking motor (with coupling)   \n",
       "\n",
       "     QUANTITY       ORDER_NM ARRIVAL_DATE SUBINVENTORY   SHIP_DATE  \\\n",
       "0           4  IR-SM00033782   2017-08-01       KR_LTH  2017-08-10   \n",
       "1           1  IR-SM00033782   2017-08-01       KR_LTH  2017-08-10   \n",
       "2           1  IR-SM00033782   2017-08-01       KR_LTH  2017-08-10   \n",
       "3           2  IR-SM00034308   2017-08-07       KR_LTH  2017-08-10   \n",
       "4           1  IR-SM00034389   2017-08-08       KR_LTH  2017-08-10   \n",
       "..        ...            ...          ...          ...         ...   \n",
       "414         3  IR-SM00388508   2020-09-01       KR_LTH  2020-09-15   \n",
       "415         3  IR-SM00388508   2020-09-01       KR_LTH  2020-09-15   \n",
       "416         1  IR-SM00401737   2020-10-13       KR_LTH  2020-10-14   \n",
       "417         1  IR-SM00386805   2020-09-04       KR_LTH  2020-09-15   \n",
       "418         1  IR-SM00440784   2020-12-21       KR_LTH  2020-12-30   \n",
       "\n",
       "                              COMMENT         STATE             TIMELINE  \n",
       "0                08/10녹십자건으로 이태환과장님출고  SHIP_CONFIRM  2023-03-01 11:10:27  \n",
       "1                08/10녹십자건으로 이태환과장님출고  SHIP_CONFIRM  2023-03-01 11:10:27  \n",
       "2                08/10녹십자건으로 이태환과장님출고  SHIP_CONFIRM  2023-03-01 11:10:27  \n",
       "3    08/10 KR_SERV01로 Transfer후 stock  SHIP_CONFIRM  2023-03-01 11:10:27  \n",
       "4           08/10삼성바이오에피스건으로 이태환과장님출고  SHIP_CONFIRM  2023-03-01 11:10:27  \n",
       "..                                ...           ...                  ...  \n",
       "414            09/15 KR_SERV01로 stock  SHIP_CONFIRM  2023-03-01 11:10:27  \n",
       "415            09/15 KR_SERV01로 stock  SHIP_CONFIRM  2023-03-01 11:10:27  \n",
       "416             10/14 이태환님 서울대 건으로 출고  SHIP_CONFIRM  2023-03-01 11:10:27  \n",
       "417  09/15 이태환님 요청으로 KR_serv01로 stock  SHIP_CONFIRM  2023-03-01 11:10:27  \n",
       "418              12/30 DGMIF 김병창님  출고  SHIP_CONFIRM  2023-03-01 11:10:27  \n",
       "\n",
       "[419 rows x 11 columns]"
      ]
     },
     "execution_count": 107,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "def bring_condition_data_pod():\n",
    "    \n",
    "    \n",
    "    wb_cy.app.screen_updating = False\n",
    "    \n",
    "    #셀정보받기\n",
    "    last_row = sel_sht.range('A1048576').end('up').row\n",
    "    if last_row < 10 : last_row=10\n",
    "    sel_sht.range((10,1),(last_row,last_col)).delete() # 기존 데이터 삭제\n",
    "    last_col = sel_sht.range('XFD9').end('left').column\n",
    "    col_names = sel_sht.range((9,1),(9,last_col)).value\n",
    "\n",
    "\n",
    "    # 드랍다운 리스트 받기\n",
    "\n",
    "    # DATE_TYPE\n",
    "    str_dt = 'ALL,ARRIVAL_DATE,SHIP_DATE'\n",
    "    rng_dt = sel_sht.range((2,\"C\"))\n",
    "    rng_dt.api.Validation.Delete()\n",
    "    rng_dt.api.Validation.Add(Type=3, Formula1=str_dt)\n",
    "    # STATE\n",
    "    str_state = \"ALL,\" + \",\".join(pd.DataFrame(cursor.execute(\"select * from inspection_code\").fetchall())[0])\n",
    "    rng_state = sel_sht.range((5,\"C\"))\n",
    "    rng_state.api.Validation.Delete()\n",
    "    rng_state.api.Validation.Add(Type=3, Formula1=str_state)\n",
    "    \n",
    "    # 검색조건 받기\n",
    "    sel_sht = wb_cy.selection.sheet\n",
    "    conditions= []\n",
    "    for i in range(2,8):\n",
    "        conditions.append(sel_sht.range((i,\"C\")).options(numbers=lambda e : str(int(e)), dates=my_date_handler).value)\n",
    "        j=i-2\n",
    "        if conditions[j] is None:\n",
    "            if j == 0:\n",
    "                conditions[j] = 'ARRIVAL_DATE'\n",
    "            else:\n",
    "                conditions[j] = 'ALL'\n",
    "                \n",
    "    #조건값 가져오기\n",
    "    base_query = \"SELECT * FROM IR_ORDER \"\n",
    "\n",
    "    if conditions[1] == 'ALL': conditions[1] = '1999-01-01'\n",
    "    if conditions[2] ==  'ALL': conditions[2] = '2199-12-31'\n",
    "\n",
    "    query = base_query + f\"WHERE {conditions[0]} BETWEEN '{conditions[1]}' AND '{conditions[2]}' \"\n",
    "    query = query if conditions[3] == 'ALL' else query + f\"AND STATE = '{conditions[3]}' \"\n",
    "    query = query if conditions[4] ==  'ALL' else query + f\"AND ARTICLE_NUMBER = '{conditions[4]}' \"\n",
    "    query = query if conditions[5] ==  'ALL' else query + f\"AND SUBINVENTORY = '{conditions[5]}'\"\n",
    "\n",
    "    # 데이터프레임 형식에 맞게 조정\n",
    "    df_ir = pd.DataFrame(cursor.execute(query).fetchall(),columns=col_names)\n",
    "    df_ir['TIMELINE'] = df_ir['TIMELINE'].map(lambda e: json.loads(e)['data'][-1]['c'])\n",
    "    df_ir = df_ir.sort_values('IR_INDEX')\n",
    "    df_ir.set_index('IR_INDEX',inplace=True)\n",
    "    \n",
    "    # 데이터 엑셀로 전송\n",
    "    sel_sht.range(\"A9\").value = df_ir\n",
    "    \n",
    "    # 서식조정\n",
    "    last_row = sel_sht.range(\"B1048576\").end('up').row\n",
    "    last_col = sel_sht.range(\"XFD9\").end(\"left\").column\n",
    "    xl_content = sel_sht.range((10,1),(last_row,last_col))\n",
    "    xl_content.api.Borders.LineStyle = 1 \n",
    "    \n",
    "    wb_cy.app.screen_updating = True"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "3d9a6b90",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 98,
   "id": "74259cdb",
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>0</th>\n",
       "      <th>1</th>\n",
       "      <th>2</th>\n",
       "      <th>3</th>\n",
       "      <th>4</th>\n",
       "      <th>5</th>\n",
       "      <th>6</th>\n",
       "      <th>7</th>\n",
       "      <th>8</th>\n",
       "      <th>9</th>\n",
       "      <th>10</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>262</td>\n",
       "      <td>18111204</td>\n",
       "      <td>SEAL KIT 100ML</td>\n",
       "      <td>4</td>\n",
       "      <td>IR-SM00033782</td>\n",
       "      <td>2017-08-01</td>\n",
       "      <td>KR_LTH</td>\n",
       "      <td>2017-08-10</td>\n",
       "      <td>08/10녹십자건으로 이태환과장님출고</td>\n",
       "      <td>SHIP_CONFIRM</td>\n",
       "      <td>{\"meta\": {\"desc\": \"data_update_timeline\", \"col...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>263</td>\n",
       "      <td>18111126</td>\n",
       "      <td>PH ELECTRODE, ROUND TIP</td>\n",
       "      <td>1</td>\n",
       "      <td>IR-SM00033782</td>\n",
       "      <td>2017-08-01</td>\n",
       "      <td>KR_LTH</td>\n",
       "      <td>2017-08-10</td>\n",
       "      <td>08/10녹십자건으로 이태환과장님출고</td>\n",
       "      <td>SHIP_CONFIRM</td>\n",
       "      <td>{\"meta\": {\"desc\": \"data_update_timeline\", \"col...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>264</td>\n",
       "      <td>29249817</td>\n",
       "      <td>LAMP ASSY CPL</td>\n",
       "      <td>1</td>\n",
       "      <td>IR-SM00033782</td>\n",
       "      <td>2017-08-01</td>\n",
       "      <td>KR_LTH</td>\n",
       "      <td>2017-08-10</td>\n",
       "      <td>08/10녹십자건으로 이태환과장님출고</td>\n",
       "      <td>SHIP_CONFIRM</td>\n",
       "      <td>{\"meta\": {\"desc\": \"data_update_timeline\", \"col...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>276</td>\n",
       "      <td>18112962</td>\n",
       "      <td>UV TEST KIT 254NM, 2MM CELL</td>\n",
       "      <td>2</td>\n",
       "      <td>IR-SM00034308</td>\n",
       "      <td>2017-08-07</td>\n",
       "      <td>KR_LTH</td>\n",
       "      <td>2017-08-10</td>\n",
       "      <td>08/10 KR_SERV01로 Transfer후 stock</td>\n",
       "      <td>SHIP_CONFIRM</td>\n",
       "      <td>{\"meta\": {\"desc\": \"data_update_timeline\", \"col...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>278</td>\n",
       "      <td>28952645</td>\n",
       "      <td>P9S Drive unit</td>\n",
       "      <td>1</td>\n",
       "      <td>IR-SM00034389</td>\n",
       "      <td>2017-08-08</td>\n",
       "      <td>KR_LTH</td>\n",
       "      <td>2017-08-10</td>\n",
       "      <td>08/10삼성바이오에피스건으로 이태환과장님출고</td>\n",
       "      <td>SHIP_CONFIRM</td>\n",
       "      <td>{\"meta\": {\"desc\": \"data_update_timeline\", \"col...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>414</th>\n",
       "      <td>5877</td>\n",
       "      <td>18117773</td>\n",
       "      <td>PM-KIT AKTA PILOT</td>\n",
       "      <td>1</td>\n",
       "      <td>IR-SM00489467</td>\n",
       "      <td>2021-11-02</td>\n",
       "      <td>KR_LTH</td>\n",
       "      <td>2021-11-04</td>\n",
       "      <td>11/04 이태환님 요청으로 KR_SERV01로 이동</td>\n",
       "      <td>SHIP_CONFIRM</td>\n",
       "      <td>{\"meta\": {\"desc\": \"data_update_timeline\", \"col...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>415</th>\n",
       "      <td>6499</td>\n",
       "      <td>11000322</td>\n",
       "      <td>CU-950 MEMORY KIT</td>\n",
       "      <td>2</td>\n",
       "      <td>IR-SM00495473</td>\n",
       "      <td>2022-01-20</td>\n",
       "      <td>KR_LTH</td>\n",
       "      <td>2022-02-15</td>\n",
       "      <td>02/15 이태환님 요청으로 출고</td>\n",
       "      <td>SHIP_CONFIRM</td>\n",
       "      <td>{\"meta\": {\"desc\": \"data_update_timeline\", \"col...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>416</th>\n",
       "      <td>6500</td>\n",
       "      <td>28404168</td>\n",
       "      <td>KEYBOARD UK/US IP65</td>\n",
       "      <td>1</td>\n",
       "      <td>IR-SM00495473</td>\n",
       "      <td>2022-01-20</td>\n",
       "      <td>KR_LTH</td>\n",
       "      <td>2022-02-15</td>\n",
       "      <td>02/15 이태환님 요청으로 출고</td>\n",
       "      <td>SHIP_CONFIRM</td>\n",
       "      <td>{\"meta\": {\"desc\": \"data_update_timeline\", \"col...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>417</th>\n",
       "      <td>5940</td>\n",
       "      <td>29273097</td>\n",
       "      <td>Atom board ver2/CFast 32 GB/battery</td>\n",
       "      <td>1</td>\n",
       "      <td>IR-SM00488627</td>\n",
       "      <td>2021-11-11</td>\n",
       "      <td>KR_LTH</td>\n",
       "      <td>2021-11-15</td>\n",
       "      <td>11/15 이태환님 출고</td>\n",
       "      <td>SHIP_CONFIRM</td>\n",
       "      <td>{\"meta\": {\"desc\": \"data_update_timeline\", \"col...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>418</th>\n",
       "      <td>4361</td>\n",
       "      <td>BR100507</td>\n",
       "      <td>Docking motor (with coupling)</td>\n",
       "      <td>1</td>\n",
       "      <td>IR-SM00440784</td>\n",
       "      <td>2020-12-21</td>\n",
       "      <td>KR_LTH</td>\n",
       "      <td>2020-12-30</td>\n",
       "      <td>12/30 DGMIF 김병창님  출고</td>\n",
       "      <td>SHIP_CONFIRM</td>\n",
       "      <td>{\"meta\": {\"desc\": \"data_update_timeline\", \"col...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>419 rows × 11 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "       0         1                                    2   3              4   \\\n",
       "0     262  18111204                       SEAL KIT 100ML   4  IR-SM00033782   \n",
       "1     263  18111126              PH ELECTRODE, ROUND TIP   1  IR-SM00033782   \n",
       "2     264  29249817                        LAMP ASSY CPL   1  IR-SM00033782   \n",
       "3     276  18112962          UV TEST KIT 254NM, 2MM CELL   2  IR-SM00034308   \n",
       "4     278  28952645                       P9S Drive unit   1  IR-SM00034389   \n",
       "..    ...       ...                                  ...  ..            ...   \n",
       "414  5877  18117773                    PM-KIT AKTA PILOT   1  IR-SM00489467   \n",
       "415  6499  11000322                    CU-950 MEMORY KIT   2  IR-SM00495473   \n",
       "416  6500  28404168                  KEYBOARD UK/US IP65   1  IR-SM00495473   \n",
       "417  5940  29273097  Atom board ver2/CFast 32 GB/battery   1  IR-SM00488627   \n",
       "418  4361  BR100507        Docking motor (with coupling)   1  IR-SM00440784   \n",
       "\n",
       "             5       6           7                                 8   \\\n",
       "0    2017-08-01  KR_LTH  2017-08-10              08/10녹십자건으로 이태환과장님출고   \n",
       "1    2017-08-01  KR_LTH  2017-08-10              08/10녹십자건으로 이태환과장님출고   \n",
       "2    2017-08-01  KR_LTH  2017-08-10              08/10녹십자건으로 이태환과장님출고   \n",
       "3    2017-08-07  KR_LTH  2017-08-10  08/10 KR_SERV01로 Transfer후 stock   \n",
       "4    2017-08-08  KR_LTH  2017-08-10         08/10삼성바이오에피스건으로 이태환과장님출고   \n",
       "..          ...     ...         ...                               ...   \n",
       "414  2021-11-02  KR_LTH  2021-11-04     11/04 이태환님 요청으로 KR_SERV01로 이동   \n",
       "415  2022-01-20  KR_LTH  2022-02-15                02/15 이태환님 요청으로 출고   \n",
       "416  2022-01-20  KR_LTH  2022-02-15                02/15 이태환님 요청으로 출고   \n",
       "417  2021-11-11  KR_LTH  2021-11-15                     11/15 이태환님 출고   \n",
       "418  2020-12-21  KR_LTH  2020-12-30              12/30 DGMIF 김병창님  출고   \n",
       "\n",
       "               9                                                  10  \n",
       "0    SHIP_CONFIRM  {\"meta\": {\"desc\": \"data_update_timeline\", \"col...  \n",
       "1    SHIP_CONFIRM  {\"meta\": {\"desc\": \"data_update_timeline\", \"col...  \n",
       "2    SHIP_CONFIRM  {\"meta\": {\"desc\": \"data_update_timeline\", \"col...  \n",
       "3    SHIP_CONFIRM  {\"meta\": {\"desc\": \"data_update_timeline\", \"col...  \n",
       "4    SHIP_CONFIRM  {\"meta\": {\"desc\": \"data_update_timeline\", \"col...  \n",
       "..            ...                                                ...  \n",
       "414  SHIP_CONFIRM  {\"meta\": {\"desc\": \"data_update_timeline\", \"col...  \n",
       "415  SHIP_CONFIRM  {\"meta\": {\"desc\": \"data_update_timeline\", \"col...  \n",
       "416  SHIP_CONFIRM  {\"meta\": {\"desc\": \"data_update_timeline\", \"col...  \n",
       "417  SHIP_CONFIRM  {\"meta\": {\"desc\": \"data_update_timeline\", \"col...  \n",
       "418  SHIP_CONFIRM  {\"meta\": {\"desc\": \"data_update_timeline\", \"col...  \n",
       "\n",
       "[419 rows x 11 columns]"
      ]
     },
     "execution_count": 98,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df_ir"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "id": "1db600e3",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 48,
   "id": "f0658d4b",
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "12"
      ]
     },
     "execution_count": 48,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "sel_sht = wb_cy.selection.sheet\n",
    "last_col = sel_sht.range('XFD9').end('left').column\n",
    "col_names = sel_sht.range((9,1),(9,last_col)).value\n",
    "idx_state=col_names.index('STATE')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 51,
   "id": "166f10dc",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "117"
      ]
     },
     "execution_count": 51,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "len('GOOD_WR,GOOD_ELSE,DMG_WET,DMG_TEMPARTURE,DMG_ONLYOUTER,DMG_IMPACT,DMG_ELSE,WR_SHORT,WR_OVER,WR_PRODUCT,WR_ELSE,RETURN')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 47,
   "id": "fc080c2e",
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "Alphabet from A-Z:\n",
      "0 A\n",
      "1 B\n",
      "2 C\n",
      "3 D\n",
      "4 E\n",
      "5 F\n",
      "6 G\n",
      "7 H\n",
      "8 I\n",
      "9 J\n",
      "10 K\n",
      "11 L\n",
      "12 M\n",
      "13 N\n",
      "14 O\n",
      "15 P\n",
      "16 Q\n",
      "17 R\n",
      "18 S\n",
      "19 T\n",
      "20 U\n",
      "21 V\n",
      "22 W\n",
      "23 X\n",
      "24 Y\n",
      "25 Z\n"
     ]
    }
   ],
   "source": [
    "import string\n",
    "\n",
    "print(\"\\nAlphabet from A-Z:\")\n",
    "for i,letter in enumerate(string.ascii_uppercase):\n",
    "    \n",
    "       print(i,letter)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 56,
   "id": "2a2c9d40",
   "metadata": {},
   "outputs": [],
   "source": [
    "def create_db_timeline(up_time_content=None):\n",
    "    \"\"\"\n",
    "    DB Table의 col중 UP_TIME 같이 업데이트가 되는 테이블들은 해당 매서드로 업데이트 \n",
    "    UPDATE 회수는 68번 제한 oracle varchar2()는 4000이 한계\n",
    "    json.loads(obj)로 이용가능한 str return\n",
    "    \"\"\"\n",
    "    import datetime as dt\n",
    "    import json\n",
    "\n",
    "    # create 시 처음 json데이터 생번\n",
    "    data=[]\n",
    "    cols=['a','b','c']\n",
    "    if up_time_content is None:\n",
    "        rows=[]\n",
    "        now = str(dt.datetime.now()).split('.')[0]\n",
    "        rows.append('create')\n",
    "        rows.append(str(0))\n",
    "        rows.append(now)\n",
    "        tmp = dict(zip(cols,rows))\n",
    "        data.append(tmp)\n",
    "        res = {\n",
    "            'meta':{\n",
    "                'desc':'data_update_timeline',\n",
    "\n",
    "                'cols':{\n",
    "                    'a':'db_method',\n",
    "                    'b':'count',\n",
    "                    'c':'timeline',\n",
    "\n",
    "                }\n",
    "            },\n",
    "            'data':data\n",
    "        }\n",
    "        return json.dumps(res,ensure_ascii=False)\n",
    "    # 데이터 생성이후 update시마다 계속 업데이트\n",
    "    else : \n",
    "        load_json = json.loads(up_time_content)['data']\n",
    "        update_count=len(load_json)\n",
    "        if len(load_json) == 68:\n",
    "            return up_time_content\n",
    "        rows=[]\n",
    "        now = str(dt.datetime.now()).split('.')[0]\n",
    "        rows.append('update')\n",
    "        rows.append(str(update_count))\n",
    "        rows.append(now)\n",
    "        tmp = dict(zip(cols,rows))\n",
    "        load_json.append(tmp)\n",
    "        res = {\n",
    "            'meta':{\n",
    "                'desc':'data_update_timeline',\n",
    "\n",
    "                'cols':{\n",
    "                    'a':'db_method',\n",
    "                    'b':'count',\n",
    "                    'c':'timeline',\n",
    "\n",
    "                }\n",
    "            },\n",
    "            'data':load_json\n",
    "        }\n",
    "        \n",
    "        return json.dumps(res,ensure_ascii=False)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 53,
   "id": "a2845b0f",
   "metadata": {},
   "outputs": [],
   "source": [
    "db_table_name = \"IR_ORDER\"\n",
    "to_status = 'GOOD_WR'\n",
    "pk_name = 'IR_INDEX'\n",
    "val = 1"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 57,
   "id": "d36b4993",
   "metadata": {},
   "outputs": [],
   "source": [
    "query = f\"UPDATE {db_table_name} SET STATE = '{to_status}' WHERE {pk_name} = {val}\"\n",
    "bring_tl_query = f\"SELECT TIMELINE FROM {db_table_name} WHERE {pk_name} = {val}\"\n",
    "try:\n",
    "    json_tl = cursor.execute(bring_tl_query).fetchone()[0]\n",
    "except:\n",
    "    wb_cy.app.alert(f\" {pk_name} : {val} 해당 INDEX는 DB에 등록되지 않은 INDEX입니다. Data는 DataInput기능으로만 저장 가능합니다. 종료합니다.\",\"Quit\")\n",
    "timeline_query = f\"UPDATE {db_table_name} SET TIMELINE = '{create_db_timeline(json_tl)}' WHERE {pk_name} = {val}\"\n",
    "cursor.execute(timeline_query)\n",
    "cursor.execute(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 58,
   "id": "4c33b355",
   "metadata": {},
   "outputs": [],
   "source": [
    "cursor.execute('commit')"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.10"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
